docs/lisp-tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-21 Wed 11:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lisp tutorial for COMP 348</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Philip Dumaresq" />
<link rel="stylesheet" type="text/css" href="https://comp-348.github.io/assets/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Lisp tutorial for COMP 348</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org835806e">Lisp at a high level</a>
<ul>
<li><a href="#org0bea26f">Lisp Syntax</a></li>
<li><a href="#orgc14b0ff">Core functions</a>
<ul>
<li><a href="#org09f7201">Destructing and rebuilding lists</a></li>
</ul>
</li>
<li><a href="#org39d6dac">Trees</a>
<ul>
<li><a href="#orgd6b5655">Binary Search:</a></li>
<li><a href="#org05ee49e">Tree Traversals</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-center">
<p>
<a href="index.html">Back</a>
</p>
</div>

<div id="outline-container-org835806e" class="outline-2">
<h2 id="org835806e">Lisp at a high level</h2>
<div class="outline-text-2" id="text-org835806e">
<p>
Lisp is a high-level, dynamically typed functional programming language. Lisp first came out in
1959, around the same time as FORTRAN. Back then it was LISP, which stood for LISt Processing. As
the name indicates, Lisp is very very good at processing linked lists, and was originally created to
prerform tasks in symbolic computation and artificial intelligence. Today, there are many modern
derivatives to LISP, such as Common Lisp, Scheme, Racket and Clojure. In this course, we focus on
Common Lisp, which first appeared in the last 1980's as a standardization by ANSI converging
features from several prominent dialects at the time. 
</p>
</div>

<div id="outline-container-org0bea26f" class="outline-3">
<h3 id="org0bea26f">Lisp Syntax</h3>
<div class="outline-text-3" id="text-org0bea26f">
<p>
Lisp syntax is very simple. Unlike most programming languages that are filled with different
syntaxes, keywords and operators, Lisp's syntax is uniform and concise. Everything that you write in
Lisp will take the form <code>(function-name arg-1 arg-2 ...)</code>. That's the whole syntax for the
language. For example, to define a linked list, we use the <code>list</code> function, like so: 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(list 1 2 3 4 5<span style="color: #5B6268;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc14b0ff" class="outline-3">
<h3 id="orgc14b0ff">Core functions</h3>
<div class="outline-text-3" id="text-orgc14b0ff">
<p>
Would as you could guess, create a list with 5 elements. Now, as mentioned, Lisp is very good at
processing linked lists, which includes extracting data from the lists, transforming them, etc. Two
of the most important functions for this are <code>car</code> and <code>cdr</code>. The first one, <code>car</code> will return the first
element of a list, and <code>cdr</code> will return a list containing everything <i>except</i> the first element - the
tail of the list. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #51afef;">defvar</span> <span style="color: #dcaeea;">my-list</span> (list 1 2 3 4 5<span style="color: #5B6268;">))</span>

(car my-list) <span style="color: #5B6268;">; 1</span>
(cdr my-list) <span style="color: #5B6268;">; '(2 3 4 5)</span>
</pre>
</div>

<p>
So in this snippet we simply define a variable called <code>my-list</code> and then get the head and the tail of
that list. The 3 important function that we need to use when dealing with lists is called <code>cons</code>, and
it allows us to <code>cons</code>-truct new lists. The arguments to <code>cons</code> are going to be the first element of the
new list, and the <i>tail</i> of the new list. For example, 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(cons 1 (list 2 3 4 5)) <span style="color: #5B6268;">; '(1 2 3 4 5)</span>
</pre>
</div>
</div>

<div id="outline-container-org09f7201" class="outline-4">
<h4 id="org09f7201">Destructing and rebuilding lists</h4>
<div class="outline-text-4" id="text-org09f7201">
<p>
We can use these 3 functions, <code>car</code>, <code>cdr</code> and <code>cons</code> to take apart lists and put them back together very
easily. Consider the following function:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">list-identity</span> (list<span style="color: #5B6268;">)</span>
  (<span style="color: #51afef;">if</span> (null list<span style="color: #5B6268;">)</span>
      (<span style="color: #5B6268;">)</span>
      (cons (car list) (list-identity (cdr list<span style="color: #5B6268;">)))))</span>
</pre>
</div>

<p>
This is an <i>identity</i> function for a list, meaning it outputs whatever was input to it. It takes a
single parameter, <code>list</code>. It first checks if the list is empty using <code>(null list)</code> - in Lisp, an empty
list is considered null. If it is empty, then we return an empty list. If it is not, then we
reconstruct a new list from the components: the head of the list, and a recursive call to the
identity function with the tail of the list. This is all just an overly comlicated way of showing
that we can use these 3 functions to take apart a list and rebuild it again recursively, and this is
a pattern that we see a lot of in Lisp. For example, let's say we wanted to add a constant number to
every value in that list:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">list-add-constant</span> (list constant<span style="color: #5B6268;">)</span>
  (<span style="color: #51afef;">if</span> (null list<span style="color: #5B6268;">)</span>
      (<span style="color: #5B6268;">)</span>
      (cons (+ (car list) constant) 
      (list-add-constant (cdr list) constant<span style="color: #5B6268;">))))</span>
</pre>
</div>

<p>
Here we have almost the same function as before: we check if the list is empty, if it is, we return
an empty list, otherwise, we construct a new list and return that. The only difference here is that
we add the constant to our number, and then pass the constant as the second argument to our
recursive call.
</p>

<p>
Like I said, this is a really common pattern in Lisp and in functional programming languages in
general, and this general pattern is going to be very helpful in your assignments. 
</p>
</div>
</div>
</div>

<div id="outline-container-org39d6dac" class="outline-3">
<h3 id="org39d6dac">Trees</h3>
<div class="outline-text-3" id="text-org39d6dac">
<p>
One of the things we do a lot of in this class is talk about binary trees. Building binary trees,
searching binary trees, balancing binary trees, etc. Here's how we tend to represent binary trees in
this course: 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(7 (1 nil 
      (2 nil nil)) 
   (8 nil 
      (9 nil nil<span style="color: #5B6268;">)))</span>
</pre>
</div>

<p>
Here, we have a single tree who's root node is <code>7</code>. It has a left subtree and a right subtree, both of
which have 2 nodes in their subtrees. If we were to visualize this as a normal tree, it would look
like this:
</p>

<div class="org-src-container">
<pre class="src src-java">    7
  /   \
 1     8
/ \   / \
   2     9
  / \   / \
</pre>
</div>

<p>
Now, since creating binary trees and balancing them is sometimes on assignments, I can't provide
those as examples, but I can do binary-search and tree traversals. 
</p>
</div>

<div id="outline-container-orgd6b5655" class="outline-4">
<h4 id="orgd6b5655">Binary Search:</h4>
<div class="outline-text-4" id="text-orgd6b5655">
<p>
A Binary search is a divide and conquer algorithm, so by nature it's going to be recursive. The
algorithm for binary search is simple:
</p>
<ol class="org-ol">
<li>if the element we're searching for is equal to the head, return true.</li>
<li>if the element we're searching for is less than the head, binary search the left subtree</li>
<li>if the element we're searching for is greater than the head, binary search the right subtree</li>
<li>If the subtree is empty, return false.</li>
</ol>

<p>
Here's how we'll implement that in Common Lisp:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">binary-search</span> (list element<span style="color: #5B6268;">)</span>
  (<span style="color: #51afef;">cond</span> 
    <span style="color: #5B6268;">; If the subtree is empty, return false</span>
    ((null list) nil<span style="color: #5B6268;">)</span>
    <span style="color: #5B6268;">; If the head is equal to what we're search for, return true</span>
    ((equal (car list) element) t<span style="color: #5B6268;">)</span>
    <span style="color: #5B6268;">; If the head is greater than the element, binary search the left subtree</span>
    ((&gt; (car list) element<span style="color: #5B6268;">)</span>
     (binary-search (second list) element<span style="color: #5B6268;">))</span>
    <span style="color: #5B6268;">; If the head is less than the element, binary search the right subtree</span>
    ((&lt; (car list) element<span style="color: #5B6268;">)</span>
     (binary-search (third list) element<span style="color: #5B6268;">)))))</span>
</pre>
</div>

<p>
As you can see this is basically just a direct transcription of the algorithm for a binary
search. We use <code>cond</code> as our control flow here, which acts as a sequence of if/else if expressions and
just return from whichever condition is true.
</p>
</div>
</div>

<div id="outline-container-org05ee49e" class="outline-4">
<h4 id="org05ee49e">Tree Traversals</h4>
<div class="outline-text-4" id="text-org05ee49e">
<p>
Another common thing we want to do with trees is traverse them in various ways. With a binary-tree,
we often want to do an in-order traversal because it will visit each element in a sorted order. The
algorithm for an in-order traversal is pretty simple:
</p>
<ol class="org-ol">
<li>If the subtree is null, stop</li>
<li>Otherwise: 
<ol class="org-ol">
<li>perform in-order-traversal on the left subtree</li>
<li>Visit the root node</li>
<li>Perform in-order-traversal on the right subtree</li>
</ol></li>
</ol>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">in-order-traversal</span> (tree<span style="color: #5B6268;">)</span>
  (<span style="color: #51afef;">cond</span>
    ((null tree) nil<span style="color: #5B6268;">)</span>
    (t (in-order-traversal (second tree<span style="color: #5B6268;">))</span>
       (print (first tree<span style="color: #5B6268;">))</span>
       (in-order-traversal (third tree<span style="color: #5B6268;">)))))</span>
</pre>
</div>

<p>
So if we run this with the same tree as above, it'll print 1, 2, 7, 8, 9. 
</p>

<p>
Now, from here there's a lot of very basic changes that we could make to make this function do some
other stuff, like instead of just printing every node, we could pass a lambda function that we call
instead of <code>print</code>. Or we could append the 3 things together to build a sorted list, or all sorts of
other things. 
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Philip Dumaresq</p>
<p class="date">Created: 2020-10-21 Wed 11:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
